package task8_radixsort;

import task2.impl.primitive.IntSortedArray;
import util.IntU;

public class Program {
    /*
    Сортировка Миллиарда чисел за линейное время
    Цель: Студенты смогут значительно быстрее отсортировать файл из прошлого занятия выбранным алгоритмом сортировки за линейное время.
    Реализовать один из рассмотренных методов сортировки за линейное время
    и отсортировать файл из 1e6, 1e7, 1e8, 1e9 целых 16-битных чисел из прошлого задания.
    Выбрать один или несколько алгоритмов:
    1. Блочная сортировка.
    2. Сортировка подсчётом.
    3. Поразрядная сортировка.
    Сравнить результаты выполнения с результатами из прошлого задания
    и дополнить таблицу сравнения производительности и сделать вывод.
    Написать, какую сортировку вы выбрали и сколько ушло времени на выполнение задания.
    Опубликовать ссылку на репозиторий, таблицу сравнения и вывод.
    Критерии оценки: +5 байт блочная сортировка
    +5 байт сортировка подсчётом
    +5 байт поразрядная сортировка
    +5 байт сравнительный анализ, заполненная таблица и вывод.
    * */
    public static void main(String[] args) {

    }
}
